app/controllers/categories_controller.rb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `name` = 'Categorie 12' WHERE `categories`.`id` = 1
---
  def update
    @category = Category.find(params[:id])
    @category.update(category_params)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 2
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy

INSERT INTO `categories` (`name`, `slug`) VALUES ('Categorie 1', 'categorie-de-test')
---
  def create
    @category = Category.create(category_params)