app/controllers/posts_controller.rb

UPDATE `posts` SET `name` = 'Article 1 !!!', `content` = 'Contenu 1', `updated_at` = '2018-09-04 22:21:04' WHERE `posts`.`id` = 1
---
  def update
    @post.update(post_params) # On met à jour

INSERT INTO `posts` (`name`, `content`, `created_at`, `updated_at`) VALUES ('Article 4', 'Contneu 4', '2018-09-04 22:32:23', '2018-09-04 22:32:23')
---
  def create
    post = Post.create(post_params)